#pragma once

//行動ログ最長データ数
#define ACTION_LENGTH 10

/*-------------------------- 課題6 ここから-----------------------------*/
//------------------------------------------
//　ジェスチャーを定義
//    ↓    ↓    ↓    ↓    ↓    ↓    ↓
//------------------------------------------
//ジェスチャー名を登録する
static const char *GestureName[] = { "NO_GESTURE", "LEFT_HAND_UP_1", "LEFT_HAND_UP_2", "BOTH_HAND", "HAND_SHAKE_RIGHT" };

enum MediaGesture
{
	//次の2つの定義は必ず必要
	END = -1,			//ジェスチャー終了
	NO_GESTURE = 0,		//ジェスチャー
	//---------------------

	//独自のジェスチャーを定義する
	LEFT_HAND_UP_1,		//左手を挙げて，左肘より右側
	LEFT_HAND_UP_2,		//左手を挙げて，左肘より左側
	BOTH_HAND,			//両手を挙げる
	HAND_SHAKE_RIGHT,	//右手で握手
};
//------------------------------------------
/*-------------------------- 課題6 ここまで-----------------------------*/





/*-------------------------- 課題8 ここから-----------------------------*/				
//------------------------------------------
//　アクションを定義
//    ↓    ↓    ↓    ↓    ↓    ↓    ↓
//------------------------------------------
//アクション名を登録する
static const char *ActionName[] = { "BYE_BYE", "BANZAI" };

enum MediaAction
{
	//次の定義は必ず必要
	NO_ACTION = -1,	 //ジェスチャー


	//独自のアクションを定義する
	BYE_BYE,	//バイバイ
	BANZAI,		//バンザイ
};
//------------------------------------------
//    ↑    ↑    ↑    ↑    ↑    ↑    ↑
//　　　　　　　ここまでに記述
//------------------------------------------

/*-------------------------- 課題8 ここまで-----------------------------*/

